GloomhavenPartyManager/app/controllers/ability_cards_controller.rb

SELECT "ability_cards".* FROM "ability_cards"
---
  def index
    @ability_cards = AbilityCard.all

UPDATE "ability_cards" SET "available" = $1, "chosen" = $2, "updated_at" = $3 WHERE "ability_cards"."id" = $4  [["available", true], ["chosen", true], ["updated_at", "2020-10-02 18:06:50.203125"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @ability_card.update(ability_card_params)

SELECT "ability_cards".* FROM "ability_cards" WHERE "ability_cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_ability_card
      @ability_card = AbilityCard.find(params[:id])