GloomhavenPartyManager/app/controllers/active_attack_cards_controller.rb

  def index
    @active_attack_cards = ActiveAttackCard.all
---
SELECT "active_attack_cards".* FROM "active_attack_cards"

  def create
    @active_attack_card = ActiveAttackCard.new(active_attack_card_params)

    respond_to do |format|
      if @active_attack_card.save
---
INSERT INTO "active_attack_cards" ("attack_card_id", "character_id", "is_drawn", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["attack_card_id", 1], ["character_id", 1], ["is_drawn", false], ["created_at", "2020-10-03 12:54:38.632322"], ["updated_at", "2020-10-03 12:54:38.632322"]]

    def set_active_attack_card
      @active_attack_card = ActiveAttackCard.find(params[:id])
---
SELECT "attack_cards".* FROM "attack_cards" WHERE "attack_cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "active_attack_cards".* FROM "active_attack_cards" WHERE "active_attack_cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]