GloomhavenPartyManager/app/controllers/attack_cards_perks_controller.rb

  def index
    @attack_cards_perks = AttackCardsPerk.all
---
SELECT "attack_cards_perks".* FROM "attack_cards_perks"

  def create
    @attack_cards_perk = AttackCardsPerk.new(attack_cards_perk_params)

    respond_to do |format|
      if @attack_cards_perk.save
---
INSERT INTO "attack_cards_perks" ("attack_card_id", "perk_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["attack_card_id", 2], ["perk_id", 1], ["created_at", "2020-10-03 00:49:05.736286"], ["updated_at", "2020-10-03 00:49:05.736286"]]

    def set_attack_cards_perk
      @attack_cards_perk = AttackCardsPerk.find(params[:id])
---
SELECT "perks".* FROM "perks" WHERE "perks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "attack_cards_perks".* FROM "attack_cards_perks" WHERE "attack_cards_perks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]