GloomhavenPartyManager/app/controllers/attack_cards_controller.rb

SELECT "attack_cards".* FROM "attack_cards"
---
  def index
    @attack_cards = AttackCard.all

INSERT INTO "attack_cards" ("name", "image", "value", "reshuffle", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Plus 1"], ["image", "am-p-07"], ["value", "1"], ["reshuffle", false], ["created_at", "2020-10-03 00:02:27.984211"], ["updated_at", "2020-10-03 00:02:27.984211"]]
---
  def create
    @attack_card = AttackCard.new(attack_card_params)

    respond_to do |format|
      if @attack_card.save

SELECT "attack_cards".* FROM "attack_cards" WHERE "attack_cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_attack_card
      @attack_card = AttackCard.find(params[:id])