GloomhavenPartyManager/app/controllers/character_scenarios_controller.rb

    def set_character_scenario
      @character_scenario = CharacterScenario.find(params[:id])
---
SELECT "character_scenarios".* FROM "character_scenarios" WHERE "character_scenarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]