GloomhavenPartyManager/app/controllers/characters_controller.rb

  def levelup_complete
    perk = Perk.find character_params[:perk_id]
    perk.applied = perk.applied + 1
    perk.save!
    raise perk.inspect

    card = AbilityCard.find character_params[:ability_card_id]
    card.available = true
    card.save

    @character.level = @character.level + 1
    respond_to do |format|
      if @character.save!
---
INSERT INTO "characters" ("name", "character_class_id", "level", "is_active", "player_id", "experience", "gold", "notes", "personal_quest", "check_marks", "party_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def retire
    @character.items.each do |item|
      item.character = nil
      item.save
---
UPDATE "characters" SET "personal_quest" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["personal_quest", "pg-510"], ["updated_at", "2020-10-03 01:43:00.226908"], ["id", 1]]

  def selected
    #set the character selected in the session
    character = Character.find_by id: params[:character_id]
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @character = Character.new(character_params)
    @character.level = 1

    respond_to do |format|
      if @character.save
---
INSERT INTO "characters" ("name", "character_class_id", "level", "is_active", "player_id", "experience", "gold", "notes", "personal_quest", "check_marks", "party_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    respond_to do |format|
      if @character.update(character_params)
---
UPDATE "characters" SET "personal_quest" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["personal_quest", "pg-510"], ["updated_at", "2020-10-03 01:43:00.226908"], ["id", 1]]