GloomhavenPartyManager/app/controllers/character_classes_controller.rb

SELECT "character_classes".* FROM "character_classes"
---
  def index
    @character_classes = CharacterClass.all

DELETE FROM "character_classes" WHERE "character_classes"."id" = $1  [["id", 2]]
---
  def destroy
    @character_class.destroy

SELECT "character_classes".* FROM "character_classes" WHERE "character_classes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_character_class
      @character_class = CharacterClass.find(params[:id])