GloomhavenPartyManager/app/controllers/character_rounds_controller.rb

SELECT "character_scenarios".* FROM "character_scenarios" WHERE "character_scenarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "character_rounds" ("round_id", "character_scenario_id", "card_1_id", "card_2_id", "short_rest", "long_rest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def long_rest
    character_s = CharacterScenario.find(params[:character_scenario_id])
    round = Round.find(params[:round_id])
    card = AbilityCard.find(params[:lost_card_id])
    card.update(status: "Lost")
    party = character_s.party
    character_round = CharacterRound.new(character_scenario: character_s, round: round, long_rest: true, party: party )

    character_s.character.items.active.discarded.update_all(used: false, counter: 0)
    character_s.character.ability_cards.discarded.update_all(status: "Available", counter: 0)
    character_round.save

SELECT "character_rounds".* FROM "character_rounds"
---
  def index
    @character_rounds = CharacterRound.all

INSERT INTO "character_rounds" ("round_id", "character_scenario_id", "card_1_id", "card_2_id", "short_rest", "long_rest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @character_round = CharacterRound.new(character_round_params)

    respond_to do |format|
      if @character_round.save

SELECT "character_rounds".* FROM "character_rounds" WHERE "character_rounds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_character_round
      @character_round = CharacterRound.find(params[:id])