GloomhavenPartyManager/app/controllers/character_scenarios_controller.rb

  def setup_character
    character = @character_scenario.character
    active_items = []
    active_items << params[:helm_id]
    active_items << params[:armor_id]
    active_items << params[:boots_id]
    if !params[:one_handed_weapon_id].nil?
      params[:one_handed_weapon_id].each do |weapon|
        active_items << weapon
      end
    end
    active_items << params[:two_handed_weapon_id]

    if !params[:items_id].nil?
      params[:items_id].each do |small_item|
        active_items << small_item
      end
    end
    if session[:temple]
      donate1 = ActiveAttackCard.new(attack_card: AttackCard.bless.first, character: @character_scenario.character, is_drawn: false)
      donate2 = ActiveAttackCard.new(attack_card: AttackCard.bless.first, character: @character_scenario.character, is_drawn: false)
      donate1.save
      donate2.save
      session[:temple] = false
    end
    equiped_items = character.items.where(id: active_items)
    equiped_items.update_all(is_active: true)

    unequiped_items = character.items.where.not(id: active_items)
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "character_scenarios" ("character_id", "scenario_id", "health", "experience", "gold", "is_poison", "is_stun", "is_invisible", "is_strengthen", "is_wound", "is_immobilize", "is_disarm", "is_muddle", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

    unequiped_cards = character.ability_cards.where.not(id: active_cards)
    unequiped_cards.update_all(active: false)

    @character_scenario.update(experience: 0, gold: 0, is_poison: false, is_stun: false, is_invisible: false,
      is_strengthen: false, is_wound: false, is_immobilize: false, is_disarm: false, is_muddle: false)
---
UPDATE "character_scenarios" SET "attack_deck_draw_order" = $1, "updated_at" = $2 WHERE "character_scenarios"."id" = $3  [["attack_deck_draw_order", "{NULL,2,1,2,1,2,1,2,1}"], ["updated_at", "2020-10-03 14:05:54.121113"], ["id", 1]]

  def remove_character
    scenario = @character_scenario.scenario
    @character_scenario.destroy
---
DELETE FROM "character_scenarios" WHERE "character_scenarios"."id" = $1  [["id", 1]]

  def index
    @character_scenarios = CharacterScenario.all
---
SELECT "character_scenarios".* FROM "character_scenarios"

  def create
    @character_scenario = CharacterScenario.new(character_scenario_params)

    respond_to do |format|
      if @character_scenario.save
---
INSERT INTO "character_scenarios" ("character_id", "scenario_id", "health", "experience", "gold", "is_poison", "is_stun", "is_invisible", "is_strengthen", "is_wound", "is_immobilize", "is_disarm", "is_muddle", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def update
    respond_to do |format|
      if @character_scenario.update(character_scenario_params)
---
UPDATE "character_scenarios" SET "attack_deck_draw_order" = $1, "updated_at" = $2 WHERE "character_scenarios"."id" = $3  [["attack_deck_draw_order", "{NULL,2,1,2,1,2,1,2,1}"], ["updated_at", "2020-10-03 14:05:54.121113"], ["id", 1]]

  def destroy
    @character_scenario.destroy
---
DELETE FROM "character_scenarios" WHERE "character_scenarios"."id" = $1  [["id", 1]]

    def set_character_scenario
      @character_scenario = CharacterScenario.find(params[:id])
---
SELECT "character_scenarios".* FROM "character_scenarios" WHERE "character_scenarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]