GloomhavenPartyManager/app/controllers/character_rounds_controller.rb

SELECT "character_rounds".* FROM "character_rounds" WHERE "character_rounds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_character_round
      @character_round = CharacterRound.find(params[:id])