GloomhavenPartyManager/app/controllers/enhancements_controller.rb

SELECT "enhancements".* FROM "enhancements"
---
  def index
    @enhancements = Enhancement.all

INSERT INTO "enhancements" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Poison"], ["created_at", "2020-10-02 17:57:47.461142"], ["updated_at", "2020-10-02 17:57:47.461142"]]
---
  def create
    @enhancement = Enhancement.new(enhancement_params)

    respond_to do |format|
      if @enhancement.save

DELETE FROM "enhancements" WHERE "enhancements"."id" = $1  [["id", 2]]
---
  def destroy
    @enhancement.destroy

SELECT "enhancements".* FROM "enhancements" WHERE "enhancements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_enhancement
      @enhancement = Enhancement.find(params[:id])