GloomhavenPartyManager/app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "number", "image", "character_id", "is_active", "counter", "counter_max", "usage_state", "used", "negative_effects", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "item_type" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["item_type", "boots"], ["updated_at", "2020-10-03 02:24:32.181390"], ["id", 1]]