GloomhavenPartyManager/app/controllers/parties_controller.rb

SELECT "parties".* FROM "parties"
---
  def index
    @parties = Party.all