GloomhavenPartyManager/app/controllers/perks_controller.rb

SELECT "perks".* FROM "perks"
---
  def index
    @perks = Perk.all

INSERT INTO "perks" ("description", "count", "character_class_id", "effects", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "Remove 2 +0 Cards"], ["count", 1], ["character_class_id", 2], ["effects", -2], ["created_at", "2020-10-03 00:30:52.203691"], ["updated_at", "2020-10-03 00:30:52.203691"]]
---
  def create
    @perk = Perk.new(perk_params)

    respond_to do |format|
      if @perk.save

SELECT "perks".* FROM "perks" WHERE "perks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_perk
      @perk = Perk.find(params[:id])