GloomhavenPartyManager/app/controllers/players_controller.rb

  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "michael"], ["email", "michael@test.org"], ["created_at", "2020-10-03 01:27:52.867297"], ["updated_at", "2020-10-03 01:27:52.867297"]]