GloomhavenPartyManager/app/controllers/rounds_controller.rb

  def index
    @rounds = Round.all
---
SELECT "rounds".* FROM "rounds"

  def create
    @round = Round.new(round_params)

    respond_to do |format|
      if @round.save
---
INSERT INTO "rounds" ("number", "scenario_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["number", 1], ["scenario_id", 1], ["created_at", "2020-10-03 11:48:27.331846"], ["updated_at", "2020-10-03 11:48:27.331846"]]

    def set_round
      @round = Round.find(params[:id])
---
SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]