GloomhavenPartyManager/app/controllers/scenarios_controller.rb

  def index
    @scenarios = Scenario.all
---
SELECT "scenarios".* FROM "scenarios"

  def create
    @scenario = Scenario.new(scenario_params)

    respond_to do |format|
      if @scenario.save
---
INSERT INTO "scenarios" ("name", "number", "party_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test scenario"], ["number", 1], ["party_id", 1], ["created_at", "2020-10-03 11:20:36.047884"], ["updated_at", "2020-10-03 11:20:36.047884"]]

    def set_scenario
      @scenario = Scenario.find(params[:id])
---
SELECT "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]