GloomhavenPartyManager/app/views/ability_cards_enhancements/_form.html.erb

    <%= form.label :ability_card_id %>
    <%= form.collection_select :ability_card_id, AbilityCard.all, :id, :name %>
---
SELECT "ability_cards".* FROM "ability_cards"

    <%= form.label :enhancement_id %>
    <%= form.collection_select :enhancement_id, Enhancement.all, :id, :description %>
---
SELECT "enhancements".* FROM "enhancements"