GloomhavenPartyManager/app/views/rounds/_form.html.erb

    <%= form.label :scenario_id %>
    <%= form.collection_select :scenario_id, Scenario.all, :id, :display %>
---
SELECT "scenarios".* FROM "scenarios"