GloomhavenPartyManager/app/views/ability_cards/_form.html.erb

SELECT "character_classes".* FROM "character_classes"
---
    <%= form.label :character_class_id %>
     <%= form.collection_select :character_class_id, CharacterClass.all, :id, :name %>