app/views/attack_cards/_form.html.erb

    <%= form.label :character_class_id %>
    <%= form.collection_select :character_class_id, CharacterClass.all, :id, :name, prompt:true %>
---
SELECT "character_classes".* FROM "character_classes"