app/views/characters/_form.html.erb

    <%= form.label :character_class_id %>
    <%= form.collection_select :character_class_id, CharacterClass.all, :id, :name, prompt: true %>
---
SELECT "character_classes".* FROM "character_classes"

    <%= form.label :player_id %>
    <%= form.collection_select :player_id, Player.all, :id, :name, prompt: true %>
---
SELECT "players".* FROM "players"

    <%= form.label :party_id %>
    <%= form.collection_select :party_id, Party.all, :id, :name, prompt: true %>
---
SELECT "parties".* FROM "parties"