app/views/active_attack_cards/_form.html.erb

    <%= form.label :attack_card_id %>
    <%= form.collection_select :attack_card_id, AttackCard.all, :id, :name %>
---
SELECT "attack_cards".* FROM "attack_cards"

    <%= form.label :character_id %>
    <%= form.collection_select :character_id, Character.all, :id, :name %>
---
SELECT "characters".* FROM "characters"