GloomhavenPartyManager/app/views/scenarios/_form.html.erb

SELECT "parties".* FROM "parties"
---
    <%= form.label :party_id %>
    <%= form.collection_select :party_id, Party.all, :id, :name %>