GloomhavenPartyManager/app/views/character_rounds/_form.html.erb

    <%= form.label :round_id %>
    <%= form.collection_select :round_id, Round.all, :id, :number %>
---
SELECT "rounds".* FROM "rounds"

    <%= form.label :character_scenario_id %>
    <%= form.collection_select :character_scenario_id, CharacterScenario.all, :id, :display %>
---
SELECT "character_scenarios".* FROM "character_scenarios"

    <%= form.label :card_1_id %>
    <%= form.collection_select :card_1_id, AbilityCard.all, :id, :name, prompt: true %>
---
SELECT "ability_cards".* FROM "ability_cards"

    <%= form.label :card_2_id %>
    <%= form.collection_select :card_2_id, AbilityCard.all, :id, :name, prompt: true %>
---
SELECT "ability_cards".* FROM "ability_cards"