app/controllers/ability_cards_enhancements_controller.rb

SELECT "ability_cards_enhancements".* FROM "ability_cards_enhancements"
---
  def index
    @ability_cards_enhancements = AbilityCardsEnhancement.all

INSERT INTO "ability_cards_enhancements" ("ability_card_id", "enhancement_id", "is_top", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ability_card_id", 1], ["enhancement_id", 1], ["is_top", true], ["created_at", "2020-10-02 22:12:46.899172"], ["updated_at", "2020-10-02 22:12:46.899172"]]
---
  def create
    @ability_cards_enhancement = AbilityCardsEnhancement.new(ability_cards_enhancement_params)

    respond_to do |format|
      if @ability_cards_enhancement.save

SELECT "enhancements".* FROM "enhancements" WHERE "enhancements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "ability_cards_enhancements".* FROM "ability_cards_enhancements" WHERE "ability_cards_enhancements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_ability_cards_enhancement
      @ability_cards_enhancement = AbilityCardsEnhancement.find(params[:id])