GloomhavenPartyManager/app/views/character_scenarios/_form.html.erb

    <%= form.label :character_id %>
    <%= form.collection_select :character_id, Character.all, :id, :name %>
---
SELECT "characters".* FROM "characters"

    <%= form.label :scenario_id %>
    <%= form.collection_select :scenario_id, Scenario.all, :id, :name %>
---
SELECT "scenarios".* FROM "scenarios"