GloomhavenPartyManager/app/views/attack_cards_perks/_form.html.erb

SELECT "attack_cards".* FROM "attack_cards"
---
    <%= form.label :attack_card_id %>
    <%= form.collection_select :attack_card_id, AttackCard.all, :id, :name %>

SELECT "perks".* FROM "perks"
---
    <%= form.label :perk_id %>
    <%= form.collection_select :perk_id, Perk.all, :id, :description%>