GloomhavenPartyManager/app/views/items/_form.html.erb

SELECT "characters".* FROM "characters"
---
    <%= form.label :character_id %>
    <%= form.collection_select :character_id, Character.all, :id, :name %>